Revit 2027 API
PanelScheduleData.PanelConfiguration Property
 The panel configuration of this panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelConfiguration PanelConfiguration { get; }
Public ReadOnly Property PanelConfiguration As PanelConfiguration
	Get
public:
property PanelConfiguration PanelConfiguration {
	PanelConfiguration get ();
}
member PanelConfiguration : PanelConfiguration with get
Property Value
PanelConfiguration
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace